04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/externalCoupledCavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField   uniform 3.75e-04;

boundaryField
{
    frontAndBack
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
    topAndBottom
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
    hot
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
    cold
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
}


// ************************************************************************* //
